In [1]:
import pandas as pd

In [4]:
df =pd.read_csv('emp.csv',delimiter='|')

In [6]:
import pandas as pd

# Sample DataFrame
data = {
    'Department': ['HR', 'IT', 'HR', 'IT', 'HR'],
    'Salary': [50000, 60000, 55000, 62000, 58000],
    'Age': [25, 30, 28, 35, 32]
}

In [7]:
data

{'Department': ['HR', 'IT', 'HR', 'IT', 'HR'],
 'Salary': [50000, 60000, 55000, 62000, 58000],
 'Age': [25, 30, 28, 35, 32]}

In [8]:
df = pd.DataFrame(data)

In [9]:
df

  Department  Salary  Age
0         HR   50000   25
1         IT   60000   30
2         HR   55000   28
3         IT   62000   35
4         HR   58000   32

In [10]:
grouped = df.groupby('Department')['Salary'].mean()

In [13]:
grouped = df.groupby('Department').agg({'Salary': ['mean', 'sum'], 'Age': 'max'})

In [14]:
grouped

                  Salary         Age
                    mean     sum max
Department
HR          54333.333333  163000  32
IT          61000.000000  122000  35

In [17]:
grouped = df.groupby('Department')['Salary'].mean()

In [18]:
grouped

Department
HR    54333.333333
IT    61000.000000
Name: Salary, dtype: float64